l3chat/mk61ext/src/main.cpp
/*
 * ADD TO PCB
 * ----------
 * + pull up resistors I2C SDA, SCL
 * + on/off switch: GND to 3V3_EN
 * + buttons RESET, BOOTSELECT
 * - SWD connector
 * + battery charger with MOSFET ON/OFF switch
 *
 *
 * DISPLAY
 * -------
 * GMG12864-06D Ver.2.2
 * ST7565R
 * https://www.lcd-module.de/eng/pdf/zubehoer/st7565r.pdf
 * https://www.youtube.com/watch?v=YwYkXSt6HfA
 * https://rcl-radio.ru/?p=83094
 * http://arduino.ru/forum/apparatnye-voprosy/podklyuchenie-displeya-gmg12864-06d-na-st7565r
 * https://www.sparkfun.com/datasheets/LCD/GDM12864H.pdf
 *
 * 1 CS  -                            - 17 //17
 * 2 RSE - reset RST                  - 18 //20
 * 3 RS  - Data/Command select DC A0  - 19 //21
 * 4 SCL -                            - 20 //18
 * 5 SI  - MOSI                       - 21 //19
 * 6 VDD - 3v3
 * 7 VSS - GND
 * 8 A   - (3v3)                      - D-pin of the P-channel MOSFET
 * 9 K   - GND
 * 10 IC_SCL
 * 11 IC_CS
 * 12 IC_SO
 * 13 IC_SI
 *
 *
 *
 * P-channel MOSFET for backlight
 * ----------------
 * G - 16
 * D - DISPLAY 8 A
 * S - 3v3
 *
 *
 *
 * external EEPROM
 * ---------------
 * AT24C256C-SSHL-T - 256 kbits
 * jlcpcb - C6482
 * https://datasheet.lcsc.com/szlcsc/Microchip-Tech-AT24C256C-SSHL-T_C6482.pdf
 *
 * Firmware expects I2C address 0x50, so tie A0/A1/A2 low.
 *
 * 1 A0  - GND
 * 2 A1  - GND
 * 3 A2  - GND
 * 4 GND - GND
 * 5 SDA - GPIO 14, with pull-up to 3v3
 * 6 SCL - GPIO 15, with pull-up to 3v3
 * 7 WP  - GND for normal writes, or 3v3 to write-protect
 * 8 VCC - 3v3
 *
 *
 *
 * LIPO charger
 * ------------
 * https://shop.pimoroni.com/products/pico-lipo-shim
 * https://cdn.shopify.com/s/files/1/0174/1800/files/lipo_shim_for_pico_schematic.pdf?v=1618573454
 * https://www.best-microcontroller-projects.com/tp4056.html
 * https://datasheet.lcsc.com/lcsc/1809261820_TOPPOWER-Nanjing-Extension-Microelectronics-TP4056-42-ESOP8_C16581.pdf
 *
 * TP4056-42-ESOP8
 * C16581
 * https://datasheet.lcsc.com/lcsc/1809261820_TOPPOWER-Nanjing-Extension-Microelectronics-TP4056-42-ESOP8_C16581.pdf
 *
 * DW01-G
 * C14213
 * https://datasheet.lcsc.com/lcsc/1810101017_Fortune-Semicon-DW01-G_C14213.pdf
 *
 * https://datasheet.lcsc.com/lcsc/1809050110_Fortune-Semicon-FS8205A_C16052.pdf
 */

#include <Arduino.h>
#include <Wire.h>

#include <array>
#include <cmath>
#include <cstdio>
#include <cstring>

#include <SparkFun_External_EEPROM.h>  // http://librarymanager/All#SparkFun_External_EEPROM

#include "CalculatorKeymap.h"
#include "Keypad.h"
#include "Mk61extDisplay.h"
#include "ProgramRecorder.h"
#include "ProgramRunner.h"
#include "ProgramVm.h"
#include "RpnCalculator.h"

#if __has_include(<hardware/clocks.h>) && __has_include(<hardware/pll.h>)
#include <hardware/clocks.h>
#include <hardware/pll.h>
#define MK61EXT_HAS_CPU_FREQUENCY_CONTROL 1
#else
#define MK61EXT_HAS_CPU_FREQUENCY_CONTROL 0
#endif

namespace {

constexpr byte kRowCount = 8;
constexpr byte kColumnCount = 5;

char kKeyMap[kRowCount][kColumnCount] = {
    {'a', 'b', 'c', 'd', 'e'},
    {'f', 'g', 'h', 'i', 'j'},
    {'k', 'l', 'm', 'n', 'o'},
    {'p', 'q', 'r', 's', 't'},
    {'7', '8', '9', '-', '/'},
    {'4', '5', '6', '+', '*'},
    {'1', '2', '3', 'u', 'v'},
    {'0', '.', 'x', 'y', 'z'},
};

byte kRowPins[kRowCount] = {7, 6, 5, 4, 3, 2, 1, 0};  // connect to the row pinouts of the keypad
byte kColumnPins[kColumnCount] = {8, 9, 10, 11, 12};  // connect to the column pinouts of the keypad

constexpr uint8_t kDisplayClockPin = 20;
constexpr uint8_t kDisplayDataPin = 21;
constexpr uint8_t kDisplayChipSelectPin = 17;
constexpr uint8_t kDisplayDataCommandPin = 19;
constexpr uint8_t kDisplayResetPin = 18;
constexpr uint8_t kBacklightPin = 16;
constexpr uint8_t kSupplySensePin = A3;

constexpr uint8_t kEepromAddress = 0x50;
constexpr uint8_t kEepromSdaPin = 14;
constexpr uint8_t kEepromSclPin = 15;
constexpr uint32_t kEepromClockHz = 400000;
constexpr uint16_t kDisplayContrast = 20;
constexpr uint16_t kLoopDelayMs = 2;
constexpr uint16_t kSleepLoopDelayMs = 100;
constexpr int kDisplayWidth = 128;
constexpr int kStatusBarHeight = 8;
constexpr int kStackFirstY = 10;
constexpr int kStackRowHeight = 14;
constexpr int kStackValueMaxPrecision = 15;
constexpr int kStackValueMinGap = 4;
constexpr int kHelpTitleY = 10;
constexpr int kHelpBodyY = 18;
constexpr int kHelpLineHeight = 7;
constexpr uint8_t kHelpBodyLineCount = 6;
constexpr int kHelpTextWidth = 126;
constexpr int kProgramListFirstY = 10;
constexpr int kProgramListRowHeight = 9;
constexpr uint8_t kProgramListVisibleRows = 6;
constexpr uint32_t kProgramRunSliceBudgetUs = 1500;
constexpr uint16_t kProgramRunMaxStepsPerSlice = 512;
constexpr int kSettingsFirstRowY = 10;
constexpr int kSettingsRowHeight = 7;
constexpr int kSettingsCursorBoxWidth = 6;
constexpr int kSettingsDescriptionY = 52;
constexpr int kSettingsDescriptionLineHeight = 6;
constexpr uint8_t kSettingsDescriptionLineCount = 2;
constexpr uint32_t kSettingsEepromAddress = 0;
constexpr uint32_t kSettingsEepromReservedBytes = 256;
constexpr uint32_t kProgramEepromAddress = kSettingsEepromAddress + kSettingsEepromReservedBytes;
constexpr uint16_t kProgramEepromReservedBytes = ProgramVm::kProgramCapacity;
constexpr uint32_t kSettingsMagic = 0x4D4B3631u;  // "MK61"
constexpr uint8_t kOlderSettingsVersion = 3;
constexpr uint8_t kLegacySettingsVersion = 4;
constexpr uint8_t kSettingsVersion = 5;
constexpr uint8_t kSupplyAdcResolutionBits = 12;
constexpr uint16_t kSupplyAdcMaxReading = (1u << kSupplyAdcResolutionBits) - 1u;
constexpr uint8_t kSupplySampleCount = 8;
constexpr uint32_t kSupplyRefreshMs = 10000;
constexpr uint32_t kRecentEventDisplayMs = 1500;
constexpr float kSupplyAdcReferenceVolts = 3.3f;
constexpr float kSupplySenseDividerScale = 3.0f;
constexpr float kExternalPowerDetectOnVolts = 4.35f;
constexpr float kExternalPowerDetectOffVolts = 4.20f;

struct TimeoutOption {
  uint32_t milliseconds;
  const char *label;
};

constexpr TimeoutOption kTimeoutOptions[] = {
    {0u, "OFF"},
    {5000u, "5 s"},
    {15000u, "15 s"},
    {30000u, "30 s"},
    {60000u, "1 min"},
    {120000u, "2 min"},
    {300000u, "5 min"},
    {900000u, "15 min"},
};

constexpr uint8_t kTimeoutOptionCount = sizeof(kTimeoutOptions) / sizeof(kTimeoutOptions[0]);
constexpr uint8_t kDefaultBacklightTimeoutIndex = 0;
constexpr uint8_t kDefaultSleepTimeoutIndex = 0;

constexpr TimeoutOption kProgramRunDisplayRefreshOptions[] = {
    {100u, "100 ms"},
    {250u, "250 ms"},
    {500u, "500 ms"},
    {1000u, "1 s"},
    {2000u, "2 s"},
};

constexpr uint8_t kProgramRunDisplayRefreshOptionCount =
    sizeof(kProgramRunDisplayRefreshOptions) / sizeof(kProgramRunDisplayRefreshOptions[0]);
constexpr uint8_t kDefaultProgramRunDisplayRefreshIndex = 3;

