l3chat/mk61ext/src/main.cpp
#if MK61EXT_HAS_CPU_FREQUENCY_CONTROL
struct CpuFrequencyOption {
  uint32_t frequencyHz;
  uint32_t vcoHz;
  uint8_t postDiv1;
  uint8_t postDiv2;
  const char *label;
};

constexpr CpuFrequencyOption kCpuFrequencyOptions[] = {
    {12000000u, 432000000u, 6, 6, "12 MHz"},
    {24000000u, 432000000u, 6, 3, "24 MHz"},
    {48000000u, 1152000000u, 6, 4, "48 MHz"},
    {96000000u, 1152000000u, 6, 2, "96 MHz"},
    {125000000u, 1500000000u, 6, 2, "125 MHz"},
};

constexpr uint8_t kCpuFrequencyOptionCount =
    sizeof(kCpuFrequencyOptions) / sizeof(kCpuFrequencyOptions[0]);
constexpr uint8_t kDefaultCpuFrequencyIndex = kCpuFrequencyOptionCount - 1;
#else
constexpr uint8_t kDefaultCpuFrequencyIndex = 0;
#endif

struct KeypadDiagnostics {
  char lastKey = NO_KEY;
  KeyState lastState = IDLE;
  bool hasEvent = false;
  uint32_t lastEventMillis = 0;
};

struct HelpState {
  bool enabled = false;
  bool hasSelection = false;
  char key = NO_KEY;
  CalculatorPrefix prefix = CalculatorPrefix::None;
};

struct StoredSettings {
  uint32_t magic = kSettingsMagic;
  uint8_t version = kSettingsVersion;
  uint8_t angleMode = static_cast<uint8_t>(CalculatorAngleMode::Radians);
  uint8_t showStackLabels = 1;
  uint8_t backlightTimeoutIndex = kDefaultBacklightTimeoutIndex;
  uint8_t sleepTimeoutIndex = kDefaultSleepTimeoutIndex;
  uint8_t cpuFrequencyIndex = kDefaultCpuFrequencyIndex;
  uint16_t brightness = 0;
  uint16_t programLength = 0;
  uint8_t programRunDisplayRefreshIndex = kDefaultProgramRunDisplayRefreshIndex;
  uint8_t reserved[4] = {};
};

static_assert(kSettingsEepromReservedBytes == 256, "settings EEPROM block must be 256 bytes");
static_assert(kProgramEepromReservedBytes == 256, "program EEPROM block must be 256 bytes");
static_assert(sizeof(StoredSettings) <= kSettingsEepromReservedBytes,
              "stored settings must fit in the reserved EEPROM settings block");

struct SettingsState {
  bool active = false;
  StoredSettings originalSettings{};
  StoredSettings stagedSettings{};
  uint8_t selectedIndex = 0;
};

enum class PendingRegisterOperation : uint8_t {
  None,
  DirectRecall,
  DirectStore,
  IndirectRecall,
  IndirectStore,
};

enum class SettingsItem : uint8_t {
  Brightness = 0,
  BacklightTimeout = 1,
  SleepTimeout = 2,
  RunDisplayRefresh = 3,
  AngleMode = 4,
  StackLabels = 5,
  CpuFrequency = 6,
};

constexpr SettingsItem kSettingsItems[] = {
    SettingsItem::Brightness,
    SettingsItem::BacklightTimeout,
    SettingsItem::SleepTimeout,
    SettingsItem::RunDisplayRefresh,
    SettingsItem::AngleMode,
    SettingsItem::StackLabels,
    SettingsItem::CpuFrequency,
};

constexpr uint8_t kSettingsItemCount = sizeof(kSettingsItems) / sizeof(kSettingsItems[0]);

Keypad keypad(makeKeymap(kKeyMap), kRowPins, kColumnPins, kRowCount, kColumnCount);
TwoWire eepromWire(kEepromSdaPin, kEepromSclPin);
ExternalEEPROM eeprom;
RpnCalculator calculator;
ProgramVm programVm;
ProgramRecorder programRecorder;
ProgramRunner programRunner;
Mk61extDisplay display(
    U8G2_R0,
    kDisplayClockPin,
    kDisplayDataPin,
    kDisplayChipSelectPin,
    kDisplayDataCommandPin,
    kDisplayResetPin);

int brightness = 0;
bool showStackLevelNames = true;
bool eepromReady = false;
uint8_t backlightTimeoutIndex = kDefaultBacklightTimeoutIndex;
uint8_t sleepTimeoutIndex = kDefaultSleepTimeoutIndex;
uint8_t cpuFrequencyIndex = kDefaultCpuFrequencyIndex;
uint8_t programRunDisplayRefreshIndex = kDefaultProgramRunDisplayRefreshIndex;
bool backlightTimedOut = false;
bool displaySleeping = false;
uint32_t lastUserActivityMs = 0;
KeypadDiagnostics keypadDiagnostics;
HelpState helpState;
SettingsState settingsState;
PendingRegisterOperation pendingRegisterOperation = PendingRegisterOperation::None;
bool programMode = false;
uint8_t programEditAddress = 0;
float supplyVoltage = NAN;
uint32_t lastSupplySampleMs = 0;
bool runningOnBattery = true;
std::array<uint8_t, ProgramVm::kProgramCapacity> savedProgramImage{};
uint16_t savedProgramLength = 0;
bool savedProgramImageValid = false;
uint32_t lastProgramRunDisplayRefreshMs = 0;

StoredSettings defaultStoredSettings() {
  StoredSettings settings{};
  settings.cpuFrequencyIndex = kDefaultCpuFrequencyIndex;
#if MK61EXT_HAS_CPU_FREQUENCY_CONTROL
  const uint32_t currentFrequencyHz = clock_get_hz(clk_sys);
  uint32_t bestDelta = UINT32_MAX;

  for (uint8_t index = 0; index < kCpuFrequencyOptionCount; ++index) {
    const uint32_t optionFrequencyHz = kCpuFrequencyOptions[index].frequencyHz;
    const uint32_t delta =
        (currentFrequencyHz > optionFrequencyHz) ? (currentFrequencyHz - optionFrequencyHz)
                                                 : (optionFrequencyHz - currentFrequencyHz);
    if (delta < bestDelta) {
      bestDelta = delta;
      settings.cpuFrequencyIndex = index;
    }
  }
#endif

  return settings;
}

uint8_t wrapOptionIndex(uint8_t currentIndex, uint8_t count, bool increase) {
  if (count == 0) {
    return 0;
  }

  if (increase) {
    return static_cast<uint8_t>((currentIndex + 1) % count);
  }

  return static_cast<uint8_t>((currentIndex + count - 1) % count);
}

const char *angleModeShortName(CalculatorAngleMode mode) {
  switch (mode) {
    case CalculatorAngleMode::Radians:
      return "RAD";
    case CalculatorAngleMode::Gradians:
      return "GRD";
    case CalculatorAngleMode::Degrees:
      return "DEG";
  }

  return "RAD";
}

CalculatorAngleMode nextAngleMode(CalculatorAngleMode mode) {
  switch (mode) {
    case CalculatorAngleMode::Radians:
      return CalculatorAngleMode::Gradians;
    case CalculatorAngleMode::Gradians:
      return CalculatorAngleMode::Degrees;
    case CalculatorAngleMode::Degrees:
      return CalculatorAngleMode::Radians;
  }

  return CalculatorAngleMode::Radians;
}

CalculatorAngleMode previousAngleMode(CalculatorAngleMode mode) {
  switch (mode) {
    case CalculatorAngleMode::Radians:
      return CalculatorAngleMode::Degrees;
    case CalculatorAngleMode::Gradians:
      return CalculatorAngleMode::Radians;
    case CalculatorAngleMode::Degrees:
      return CalculatorAngleMode::Gradians;
  }

  return CalculatorAngleMode::Radians;
}

uint32_t timeoutMilliseconds(uint8_t index) {
  if (index >= kTimeoutOptionCount) {
    return kTimeoutOptions[kDefaultBacklightTimeoutIndex].milliseconds;
  }

  return kTimeoutOptions[index].milliseconds;
}

uint32_t programRunDisplayRefreshMilliseconds(uint8_t index) {
  if (index >= kProgramRunDisplayRefreshOptionCount) {
    return kProgramRunDisplayRefreshOptions[kDefaultProgramRunDisplayRefreshIndex].milliseconds;
  }

  return kProgramRunDisplayRefreshOptions[index].milliseconds;
}

