l3chat/mk61ext/src/main.cpp
const char *programRunDisplayRefreshLabel(uint8_t index) {
  if (index >= kProgramRunDisplayRefreshOptionCount) {
    return kProgramRunDisplayRefreshOptions[kDefaultProgramRunDisplayRefreshIndex].label;
  }

  return kProgramRunDisplayRefreshOptions[index].label;
}

const char *timeoutLabel(uint8_t index) {
  if (index >= kTimeoutOptionCount) {
    return kTimeoutOptions[kDefaultBacklightTimeoutIndex].label;
  }

  return kTimeoutOptions[index].label;
}

#if MK61EXT_HAS_CPU_FREQUENCY_CONTROL
const char *cpuFrequencyLabel(uint8_t index) {
  if (index >= kCpuFrequencyOptionCount) {
    return kCpuFrequencyOptions[kDefaultCpuFrequencyIndex].label;
  }

  return kCpuFrequencyOptions[index].label;
}

bool applyCpuFrequencySetting(uint8_t index) {
  if (index >= kCpuFrequencyOptionCount) {
    return false;
  }

  const CpuFrequencyOption &option = kCpuFrequencyOptions[index];
  if (clock_get_hz(clk_sys) == option.frequencyHz) {
    cpuFrequencyIndex = index;
    SystemCoreClock = option.frequencyHz;
    return true;
  }

  clock_configure(clk_sys,
                  CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLKSRC_CLK_SYS_AUX,
                  CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB,
                  48 * MHZ,
                  48 * MHZ);

  pll_deinit(pll_sys);
  pll_init(pll_sys, 1, option.vcoHz, option.postDiv1, option.postDiv2);

  clock_configure(clk_ref,
                  CLOCKS_CLK_REF_CTRL_SRC_VALUE_XOSC_CLKSRC,
                  0,
                  XOSC_MHZ * MHZ,
                  XOSC_MHZ * MHZ);

  clock_configure(clk_sys,
                  CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLKSRC_CLK_SYS_AUX,
                  CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS,
                  option.frequencyHz,
                  option.frequencyHz);

  clock_configure(clk_peri,
                  0,
                  CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLK_SYS,
                  option.frequencyHz,
                  option.frequencyHz);

  cpuFrequencyIndex = index;
  SystemCoreClock = option.frequencyHz;
  return clock_get_hz(clk_sys) == option.frequencyHz;
}
#else
const char *cpuFrequencyLabel(uint8_t) {
  return "FIXED";
}

bool applyCpuFrequencySetting(uint8_t index) {
  cpuFrequencyIndex = kDefaultCpuFrequencyIndex;
  return index == kDefaultCpuFrequencyIndex;
}
#endif

void applyBrightness();
void updatePowerSourceState();
void normalizeProgramEditAddress();

void noteUserActivity() {
  lastUserActivityMs = millis();
  backlightTimedOut = false;

  if (displaySleeping) {
    displaySleeping = false;
    display.setPowerSave(0);
  }

  applyBrightness();
}

bool isValidStoredSettings(const StoredSettings &settings) {
  if (settings.magic != kSettingsMagic) {
    return false;
  }

  if ((settings.version != kSettingsVersion) && (settings.version != kLegacySettingsVersion) &&
      (settings.version != kOlderSettingsVersion)) {
    return false;
  }

  if (settings.angleMode > static_cast<uint8_t>(CalculatorAngleMode::Degrees)) {
    return false;
  }

  if (settings.brightness > 256) {
    return false;
  }

  if (settings.backlightTimeoutIndex >= kTimeoutOptionCount) {
    return false;
  }

  if (settings.sleepTimeoutIndex >= kTimeoutOptionCount) {
    return false;
  }

  if ((settings.version == kSettingsVersion) &&
      (settings.programRunDisplayRefreshIndex >= kProgramRunDisplayRefreshOptionCount)) {
    return false;
  }

#if MK61EXT_HAS_CPU_FREQUENCY_CONTROL
  if (settings.cpuFrequencyIndex >= kCpuFrequencyOptionCount) {
    return false;
  }
#endif

  if ((settings.version != kOlderSettingsVersion) &&
      (settings.programLength > ProgramVm::kProgramCapacity)) {
    return false;
  }

  return true;
}

bool normalizeStoredSettings(StoredSettings &settings) {
  if (settings.version == kSettingsVersion) {
    return false;
  }

  const uint8_t previousVersion = settings.version;
  settings.version = kSettingsVersion;
  settings.programRunDisplayRefreshIndex = kDefaultProgramRunDisplayRefreshIndex;
  if (previousVersion == kOlderSettingsVersion) {
    settings.programLength = 0;
  }
  std::memset(settings.reserved, 0, sizeof(settings.reserved));
  return true;
}

StoredSettings currentStoredSettings() {
  StoredSettings settings = defaultStoredSettings();
  settings.angleMode = static_cast<uint8_t>(calculator.angleMode());
  settings.showStackLabels = showStackLevelNames ? 1 : 0;
  settings.backlightTimeoutIndex = backlightTimeoutIndex;
  settings.sleepTimeoutIndex = sleepTimeoutIndex;
  settings.cpuFrequencyIndex = cpuFrequencyIndex;
  settings.programRunDisplayRefreshIndex = programRunDisplayRefreshIndex;
  settings.brightness = static_cast<uint16_t>(brightness);
  settings.programLength = savedProgramLength;
  return settings;
}

void applyBrightness() {
  if (displaySleeping || backlightTimedOut || (brightness <= 0)) {
    analogWrite(kBacklightPin, -1);
    digitalWrite(kBacklightPin, HIGH);  // off
  } else if (brightness >= 256) {
    analogWrite(kBacklightPin, -1);
    digitalWrite(kBacklightPin, LOW);  // on
  } else {
    analogWrite(kBacklightPin, 255 - brightness);
  }
}

void setupSupplySense() {
  analogReadResolution(kSupplyAdcResolutionBits);
}

float readSupplyVoltage() {
  uint32_t rawTotal = 0;

  // On the Pico board, A3/GPIO29 is tied to VSYS through a 1:3 divider.
  for (uint8_t sample = 0; sample < kSupplySampleCount; ++sample) {
    rawTotal += static_cast<uint32_t>(analogRead(kSupplySensePin));
  }

  const float rawAverage = static_cast<float>(rawTotal) / static_cast<float>(kSupplySampleCount);
  const float sensedVoltage = (rawAverage / static_cast<float>(kSupplyAdcMaxReading)) * kSupplyAdcReferenceVolts;
  return sensedVoltage * kSupplySenseDividerScale;
}

void updateSupplyVoltage(bool force = false) {
  const uint32_t now = millis();
  if (!force && std::isfinite(supplyVoltage) && ((now - lastSupplySampleMs) < kSupplyRefreshMs)) {
    return;
  }

  supplyVoltage = readSupplyVoltage();
  lastSupplySampleMs = now;
  updatePowerSourceState();
}

void formatSupplyVoltage(char *buffer, size_t bufferSize) {
  if (!std::isfinite(supplyVoltage)) {
    snprintf(buffer, bufferSize, "--.--V");
    return;
  }

