l3chat/mk61ext/src/main.cpp
  return "";
}

void clearHelpSelection() {
  helpState.hasSelection = false;
  helpState.key = NO_KEY;
  helpState.prefix = CalculatorPrefix::None;
}

void clearPendingRegisterOperation() {
  pendingRegisterOperation = PendingRegisterOperation::None;
}

void normalizeProgramEditAddress() {
  const uint16_t length = programVm.programLength();
  if (programEditAddress > length) {
    programEditAddress = static_cast<uint8_t>(length);
  }

  if (!programVm.isStepBoundary(programEditAddress)) {
    programEditAddress = static_cast<uint8_t>(length);
  }
}

void enterProgramMode() {
  programRunner.stop();
  programRunner.clearPausedExecution();
  programMode = true;
  programRecorder.reset();
  normalizeProgramEditAddress();
  clearPendingRegisterOperation();
  resetCalculatorKeymapState();
  clearHelpSelection();
  noteUserActivity();
}

void exitProgramMode() {
  programMode = false;
  programRecorder.reset();
  clearPendingRegisterOperation();
  resetCalculatorKeymapState();
  noteUserActivity();
}

void enterSettingsMode() {
  settingsState.active = true;
  settingsState.originalSettings = currentStoredSettings();
  settingsState.stagedSettings = settingsState.originalSettings;
  settingsState.selectedIndex = 0;
  programRecorder.reset();
  helpState.enabled = false;
  clearHelpSelection();
  clearPendingRegisterOperation();
  resetCalculatorKeymapState();
  noteUserActivity();
}

void exitSettingsMode() {
  settingsState.active = false;
  saveSettings(settingsState.stagedSettings);
  clearPendingRegisterOperation();
  resetCalculatorKeymapState();
  noteUserActivity();
}

void cancelSettingsMode() {
  applyStoredSettings(settingsState.originalSettings);
  settingsState.active = false;
  clearPendingRegisterOperation();
  resetCalculatorKeymapState();
  noteUserActivity();
}

void applyStagedSettings() {
  applyStoredSettings(settingsState.stagedSettings);
}

void selectPreviousSettingsItem() {
  settingsState.selectedIndex =
      (settingsState.selectedIndex + kSettingsItemCount - 1) % kSettingsItemCount;
}

void selectNextSettingsItem() {
  settingsState.selectedIndex = (settingsState.selectedIndex + 1) % kSettingsItemCount;
}

void adjustSelectedSetting(bool increase) {
  const SettingsItem item = kSettingsItems[settingsState.selectedIndex];

  switch (item) {
    case SettingsItem::Brightness:
      settingsState.stagedSettings.brightness = increase
                                                    ? increaseBrightnessValue(settingsState.stagedSettings.brightness)
                                                    : decreaseBrightnessValue(settingsState.stagedSettings.brightness);
      break;
    case SettingsItem::BacklightTimeout:
      settingsState.stagedSettings.backlightTimeoutIndex =
          wrapOptionIndex(settingsState.stagedSettings.backlightTimeoutIndex, kTimeoutOptionCount, increase);
      break;
    case SettingsItem::SleepTimeout:
      settingsState.stagedSettings.sleepTimeoutIndex =
          wrapOptionIndex(settingsState.stagedSettings.sleepTimeoutIndex, kTimeoutOptionCount, increase);
      break;
    case SettingsItem::RunDisplayRefresh:
      settingsState.stagedSettings.programRunDisplayRefreshIndex =
          wrapOptionIndex(settingsState.stagedSettings.programRunDisplayRefreshIndex,
                          kProgramRunDisplayRefreshOptionCount,
                          increase);
      break;
    case SettingsItem::AngleMode: {
      const CalculatorAngleMode currentMode =
          static_cast<CalculatorAngleMode>(settingsState.stagedSettings.angleMode);
      settingsState.stagedSettings.angleMode =
          static_cast<uint8_t>(increase ? nextAngleMode(currentMode) : previousAngleMode(currentMode));
      break;
    }
    case SettingsItem::StackLabels:
      settingsState.stagedSettings.showStackLabels =
          settingsState.stagedSettings.showStackLabels != 0 ? 0 : 1;
      break;
    case SettingsItem::CpuFrequency:
      settingsState.stagedSettings.cpuFrequencyIndex =
          wrapOptionIndex(settingsState.stagedSettings.cpuFrequencyIndex,
#if MK61EXT_HAS_CPU_FREQUENCY_CONTROL
                          kCpuFrequencyOptionCount,
#else
                          1,
#endif
                          increase);
      break;
  }

  applyStagedSettings();
}

void armPendingRegisterOperation(PendingRegisterOperation operation) {
  pendingRegisterOperation = operation;
  resetCalculatorKeymapState();
}

const char *pendingRegisterOperationName() {
  switch (pendingRegisterOperation) {
    case PendingRegisterOperation::DirectRecall:
      return "MX";
    case PendingRegisterOperation::DirectStore:
      return "XM";
    case PendingRegisterOperation::IndirectRecall:
      return "MXI";
    case PendingRegisterOperation::IndirectStore:
      return "XMI";
    case PendingRegisterOperation::None:
      return "";
  }

  return "";
}

bool decodeRegisterKey(char keyPressed, uint8_t &index) {
  if ((keyPressed >= '0') && (keyPressed <= '9')) {
    index = static_cast<uint8_t>(keyPressed - '0');
    return true;
  }

  switch (keyPressed) {
    case '.':
      index = 10;
      return true;
    case 'x':
      index = 11;
      return true;
    case 'y':
      index = 12;
      return true;
    case 'z':
      index = 13;
      return true;
    case 'v':
      index = 14;
      return true;
    case 'u':
      index = 15;
      return true;
    default:
      return false;
  }
}

void setHelpMode(bool enabled) {
  helpState.enabled = enabled;
  clearHelpSelection();
  clearPendingRegisterOperation();
  programRecorder.reset();
  resetCalculatorKeymapState();
}

void toggleHelpMode() {
  setHelpMode(!helpState.enabled);
}

void rememberHelpSelection(char keyPressed, CalculatorPrefix prefix) {
  helpState.hasSelection = true;
  helpState.key = keyPressed;
  helpState.prefix = prefix;
}

void handleHelpPressedKey(char keyPressed) {
  if ((keyPressed == 'a') || (keyPressed == 'b')) {
    resetCalculatorKeymapState();
    rememberHelpSelection(keyPressed, CalculatorPrefix::None);
    return;
  }

  const CalculatorPrefix prefixBefore =
      ((keyPressed == 'k') || (keyPressed == 'p')) ? CalculatorPrefix::None : activeCalculatorPrefix();
  (void)translateKeyToCalculatorAction(keyPressed);
  rememberHelpSelection(keyPressed, prefixBefore);
}

