l3chat/mk61ext/src/main.cpp
void drawRightAlignedText(int rightEdge, int y, const char *text) {
  display.drawStr(rightEdge - display.getStrWidth(text), y, text);
}

void formatStackValueToFit(CalculatorValue value,
                           char *buffer,
                           size_t bufferSize,
                           int maxPixelWidth) {
  for (int precision = kStackValueMaxPrecision; precision >= 1; --precision) {
    formatStackValue(value, buffer, bufferSize, precision);
    if (display.getStrWidth(buffer) <= maxPixelWidth) {
      return;
    }
  }

  formatStackValue(value, buffer, bufferSize, 1);
}

void drawStackTextLine(int y, const char *label, const char *text) {
  display.setFont(u8g2_font_6x10_mr);
  if ((label != nullptr) && (label[0] != '\0')) {
    display.drawStr(0, y, label);
  }
  drawRightAlignedText(kDisplayWidth - 1, y, text);
}

void drawStackLine(int y, const char *label, CalculatorValue value) {
  char valueBuffer[32];

  display.setFont(u8g2_font_6x10_mr);
  const int labelWidth = ((label != nullptr) && (label[0] != '\0')) ? display.getStrWidth(label) : 0;
  const int gap = (labelWidth > 0) ? kStackValueMinGap : 0;
  const int maxValueWidth = kDisplayWidth - labelWidth - gap;
  formatStackValueToFit(value, valueBuffer, sizeof(valueBuffer), maxValueWidth);
  drawStackTextLine(y, label, valueBuffer);
}

void formatXDisplayToFit(char *buffer, size_t bufferSize, int maxPixelWidth) {
  for (int precision = kStackValueMaxPrecision; precision >= 1; --precision) {
    calculator.formatXForDisplay(buffer, bufferSize, precision);
    if (display.getStrWidth(buffer) <= maxPixelWidth) {
      return;
    }
  }

  calculator.formatXForDisplay(buffer, bufferSize, 1);
}

void setupDisplay() {
  brightness = 0;
  pinMode(kBacklightPin, OUTPUT);
  applyBrightness();

  display.begin();
  display.setPowerSave(0);
  display.setFlipMode(1);
  display.setContrast(kDisplayContrast);
  display.setFont(u8g2_font_t0_15b_mr);
  display.setFontRefHeightExtendedText();
  display.setDrawColor(1);
  display.setFontPosTop();
  display.setFontDirection(0);
}

void setupEeprom() {
  eepromWire.setClock(kEepromClockHz);
  eepromWire.begin();

  if (!eeprom.begin(kEepromAddress, eepromWire)) {
    display.drawStr(0, 0, "no memory found");
    while (true) {
      delay(1);
    }
  }

  display.drawStr(0, 0, "  memory found");
  eeprom.setMemorySize(262144 / 8);  // EEPROM is the AT24C256 (256 Kbit = 32768 bytes)
  eeprom.setPageSize(64);
  eeprom.setPageWriteTime(3);
  eeprom.disablePollForWriteComplete();
  eepromReady = true;
}

const char *calculatorModeName() {
  if (calculator.hasError()) {
    return "ERR";
  }

  if (calculator.isEnteringExponent()) {
    return "EEX";
  }

  if (calculator.isEntering()) {
    return "ENT";
  }

  return "RUN";
}

const char *programRecorderErrorShortName(ProgramRecorderError error) {
  switch (error) {
    case ProgramRecorderError::None:
      return "";
    case ProgramRecorderError::InvalidKey:
      return "KEY";
    case ProgramRecorderError::InvalidOperand:
      return "OPR";
    case ProgramRecorderError::CommitFailed:
      return "MEM";
  }

  return "ERR";
}

void formatEventLabel(char *buffer, size_t bufferSize) {
  if (!keypadDiagnostics.hasEvent) {
    snprintf(buffer, bufferSize, "--");
    return;
  }

  snprintf(buffer, bufferSize, "%c %s", keypadDiagnostics.lastKey, keyStateName(keypadDiagnostics.lastState));
}

bool shouldShowRecentEvent() {
  return keypadDiagnostics.hasEvent && ((millis() - keypadDiagnostics.lastEventMillis) < kRecentEventDisplayMs);
}

void formatStatusRightText(char *buffer, size_t bufferSize) {
  if (shouldShowRecentEvent()) {
    formatEventLabel(buffer, bufferSize);
    return;
  }

  formatSupplyVoltage(buffer, bufferSize);
}

void drawStatusBar() {
  char leftBuffer[32];
  char rightBuffer[18];
  const unsigned runAddress = static_cast<unsigned>(programRunner.runAddress());

  if (settingsState.active) {
    snprintf(leftBuffer, sizeof(leftBuffer), "SET");
    snprintf(rightBuffer, sizeof(rightBuffer), "e OK f ESC");
  } else if (helpState.enabled) {
    const char *prefixName = activeCalculatorPrefixName();
    if (prefixName[0] != '\0') {
      snprintf(leftBuffer,
               sizeof(leftBuffer),
               "PC%02X %s HELP %s",
               runAddress,
               angleModeShortName(calculator.angleMode()),
               prefixName);
    } else {
      snprintf(leftBuffer,
               sizeof(leftBuffer),
               "PC%02X %s HELP",
               runAddress,
               angleModeShortName(calculator.angleMode()));
    }
    formatStatusRightText(rightBuffer, sizeof(rightBuffer));
  } else if (programMode) {
    const char *recorderErrorShort = programRecorderErrorShortName(programRecorder.error());
    const char *recorderPrefix = programRecorder.activePrefixName();
    const char *editModeShort = programRecorder.insertModeEnabled() ? "INS" : "OVR";
    const unsigned editAddress = static_cast<unsigned>(programEditAddress);
    const unsigned programLength = static_cast<unsigned>(programVm.programLength());
    if (recorderErrorShort[0] != '\0') {
      snprintf(leftBuffer,
               sizeof(leftBuffer),
               "P%02X L%02X %s E:%s",
               editAddress,
               programLength,
               editModeShort,
               recorderErrorShort);
    } else if (programRecorder.hasPendingOperand()) {
      snprintf(leftBuffer,
               sizeof(leftBuffer),
               "P%02X L%02X %s PND",
               editAddress,
               programLength,
               editModeShort);
    } else if (recorderPrefix[0] != '\0') {
      snprintf(leftBuffer,
               sizeof(leftBuffer),
               "P%02X L%02X %s %s",
               editAddress,
               programLength,
               editModeShort,
               recorderPrefix);
    } else {
      snprintf(leftBuffer, sizeof(leftBuffer), "P%02X L%02X %s", editAddress, programLength, editModeShort);
    }
    formatStatusRightText(rightBuffer, sizeof(rightBuffer));
  } else if (programRunner.hasError()) {
    snprintf(leftBuffer,
             sizeof(leftBuffer),
             "PC%02X VM %s",
             runAddress,
             programRunnerErrorShortName(programRunner.error()));
    formatStatusRightText(rightBuffer, sizeof(rightBuffer));
  } else if (programRunner.isRunning()) {
    snprintf(leftBuffer, sizeof(leftBuffer), "PC%02X RUN", runAddress);
    formatStatusRightText(rightBuffer, sizeof(rightBuffer));
  } else if (calculator.hasError()) {
    snprintf(leftBuffer, sizeof(leftBuffer), "PC%02X ERR %s", runAddress, calculator.errorMessage());
    formatStatusRightText(rightBuffer, sizeof(rightBuffer));
  } else if (pendingRegisterOperation != PendingRegisterOperation::None) {
    snprintf(leftBuffer,
             sizeof(leftBuffer),
             "PC%02X %s %s",
             runAddress,
             angleModeShortName(calculator.angleMode()),
             pendingRegisterOperationName());
    formatStatusRightText(rightBuffer, sizeof(rightBuffer));
  } else {
    const char *prefixName = activeCalculatorPrefixName();
    if (prefixName[0] != '\0') {
      snprintf(leftBuffer,
               sizeof(leftBuffer),
               "PC%02X %s %s %s",
               runAddress,
               prefixName,
               angleModeShortName(calculator.angleMode()),
               calculatorModeName());
    } else {
      snprintf(leftBuffer,
               sizeof(leftBuffer),
               "PC%02X %s %s",
               runAddress,
               angleModeShortName(calculator.angleMode()),
               calculatorModeName());
    }
    formatStatusRightText(rightBuffer, sizeof(rightBuffer));
  }

  display.setFont(u8g2_font_5x7_mr);
  display.drawBox(0, 0, kDisplayWidth, kStatusBarHeight);
  display.setDrawColor(0);
  display.drawStr(2, 1, leftBuffer);
  if ((rightBuffer[0] != '\0') &&
      ((display.getStrWidth(leftBuffer) + display.getStrWidth(rightBuffer) + 6) < kDisplayWidth)) {
    drawRightAlignedText(kDisplayWidth - 2, 1, rightBuffer);
  }
  display.setDrawColor(1);
}

void drawWrappedText(int x,
                     int y,
                     const char *text,
                     int maxPixelWidth,
                     uint8_t maxLines,
                     int lineHeight) {
  char lineBuffer[64];
  size_t position = 0;

